
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = 
		СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.СписаниеДенежныхСредств КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расшифровка.Ссылка КАК Ссылка,
	|	Расшифровка.Основание.Контрагент КАК Контрагент,
	|	Расшифровка.Основание КАК Основание,
	|	Расшифровка.Сумма КАК Сумма,
	|	Расшифровка.СуммаУпр КАК СуммаУпр,
	|	Расшифровка.Перевозка КАК Перевозка
	|ПОМЕСТИТЬ Расшифровка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК Расшифровка
	|ГДЕ
	|	Расшифровка.Ссылка = &Ссылка";

	Запрос.Выполнить();
	
	ПодготовитьТаблицуВзаиморасчетыСКонтрагентами(Запрос, СтруктураДополнительныеСвойства);
	ПодготовитьТаблицуОплаты(Запрос, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеТаблицДляПроведения

Процедура ПодготовитьТаблицуВзаиморасчетыСКонтрагентами(Запрос, СтруктураДополнительныеСвойства)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Расшифровка.Контрагент КАК Контрагент,
	|	Расшифровка.Перевозка КАК Перевозка,
	|	Расшифровка.Основание КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация,
	|	СУММА(Расшифровка.Сумма) КАК Сумма,
	|	СУММА(Расшифровка.СуммаУпр) КАК СуммаУпр,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Расшифровка КАК Расшифровка
	|		ПО Док.Ссылка = Расшифровка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Расшифровка.Основание,
	|	Расшифровка.Перевозка,
	|	Док.Организация,
	|	Расшифровка.Контрагент,
	|	Док.Период,
	|	Док.Валюта";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", 
		Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

Процедура ПодготовитьТаблицуОплаты(Запрос, СтруктураДополнительныеСвойства)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Организация КАК Организация,
	|	Расшифровка.Контрагент КАК Контрагент,
	|	СУММА(-Расшифровка.Сумма) КАК Сумма
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Расшифровка КАК Расшифровка
	|		ПО Док.Ссылка = Расшифровка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Период,
	|	Док.Организация,
	|	Расшифровка.Контрагент";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплаты", 
		Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли