#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслуг") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Валюта, Организация, СуммаДокумента");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Основание,
		|	ДокУслуги.Перевозка КАК Перевозка,
		|	Док.Контрагент КАК Контрагент,
		|	СУММА(ДокУслуги.Сумма) КАК Сумма,
		|	СУММА(ДокУслуги.СуммаУпр) КАК СуммаУпр
		|ИЗ
		|	Документ.ПоступлениеУслуг.Услуги КАК ДокУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслуг КАК Док
		|		ПО ДокУслуги.Ссылка = Док.Ссылка
		|			И (Док.Ссылка = &Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокУслуги.Перевозка,
		|	Док.Ссылка,
		|	Док.Контрагент";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
	
		РасшифровкаПлатежа.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	пзОбщегоНазначения.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.СписаниеДенежныхСредств.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	пзОбщегоНазначения.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	пзОбщегоНазначения.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	пзОбщегоНазначения.ОтразитьОплаты(ДополнительныеСвойства, Движения, Отказ);
	
	пзОбщегоНазначения.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	пзОбщегоНазначения.ПеревестиЗаявкиВСтатусЗакрыт(Ссылка);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
