
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСообщения(Команда)
	ПолучитьСообщенияНаСервере(ПредопределенноеЗначение("Документ.ЗаявкаОтЗаказчика.ПустаяСсылка"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСообщенияНаСервере(СсылкаНаОбъект)
	
	Топики = Новый Массив;
	Топики.Добавить(КафкаСервер.ПолучитьТопикОбъекта(СсылкаНаОбъект));
	
	ТекстОшибки = "";
	КафкаСервер.ПрочитатьСообщения(Топики, ТекстОшибки);
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки); 
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти


