#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбора()
	
	Элементы.ИмяОбъекта.СписокВыбора.Очистить();
	
	НаборМетаданных = Новый Массив;
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"Справочники", Метаданные.Справочники, "Справочник"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"Документы", Метаданные.Документы, "Документ"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"БизнесПроцессы", Метаданные.БизнесПроцессы, "БизнесПроцесс"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"ПланыВидовХарактеристик", Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"РегистрыСведений", Метаданные.РегистрыСведений, "РегистрСведений"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"РегистрыНакопления", Метаданные.РегистрыНакопления, "РегистрНакопления"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"РегистрыБухгалтерии", Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерии"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"РегистрыРасчета", Метаданные.РегистрыРасчета, "РегистрРасчета"));
	НаборМетаданных.Добавить(Новый Структура("Имя, Мета, Зачение", 
		"Задачи", Метаданные.Задачи, "Задача"));
	
	Для каждого СтруктураМета Из НаборМетаданных Цикл
		Для каждого ОбъектМета Из СтруктураМета.Мета Цикл
			Элементы.ИмяОбъекта.СписокВыбора.Добавить(СтруктураМета.Зачение + "." + ОбъектМета.Имя);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
