#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты.ДобавитьТестовыйНабор("Документ Реализация Услуг: Проверка проведения").ВТранзакции()
		.ДобавитьТест("ПроверкаПроведенияПозитив")
		.ДобавитьТест("ПроверкаПроведенияНегатив") 
		.ДобавитьТест("ПроверкаПроведенияСКонтролемДвижений")
		.ДобавитьТест("ПроверкаОстаткиПоОтложеннымВзаиморасчетамУшлиВНоль")
		.ДобавитьТест("ПроверкаЕстьОстаткиПоВзаиморасчетамСКонтрагентами")
		;

КонецПроцедуры

Процедура ПроверкаПроведенияПозитив() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();
	
	ЮТест.ОжидаетЧто(Реализация.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведенияНегатив() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();
	РеализацияОбъект = Реализация.ПолучитьОбъект();
	РеализацияОбъект.Услуги[0].Сумма = РеализацияОбъект.Услуги[0].Сумма + 100; 
	РеализацияОбъект.Записать();	
	
	ЮТест.ОжидаетЧто(РеализацияОбъект)  
		.Метод("Записать",  ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение)) 
		.ВыбрасываетИсключение("Не удалось провести ""Реализация услуг")	
		;
		
	Сообщения = ПолучитьСообщенияПользователю();
	ЮТест.ОжидаетЧто(Сообщения)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(1)
		.Свойство("[0].Текст")
			.ИмеетТип("Строка")
			.Содержит("Сумма реализации больше суммы заявок")
		;

КонецПроцедуры

Процедура ПроверкаПроведенияСКонтролемДвижений() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();
	
	ЮТест.ОжидаетЧто(Реализация.ПолучитьОбъект())  
		.Метод("Записать",  ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение)) 
		.НеВыбрасываетИсключение("Не удалось провести ""Реализация услуг")	
		;
		
	ДокОбъект = Реализация.ПолучитьОбъект();;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Для каждого Движ Из ДокОбъект.Движения Цикл
		ЮТест.ОжидаетЧто(Движ.Количество())
			.БольшеИлиРавно(1, "Проверка наличия движений")
		;	
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверкаОстаткиПоОтложеннымВзаиморасчетамУшлиВНоль() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();;
	
	ДокОбъект = Реализация.ПолучитьОбъект();;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.РеализацияУслуг КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуг.Ссылка КАК Ссылка,
	|	ТаблицаУслуг.Услуга КАК Услуга,
	|	ТаблицаУслуг.Сумма КАК Сумма,
	|	ТаблицаУслуг.СуммаУпр КАК СуммаУпр,
	|	ТаблицаУслуг.Перевозка КАК Перевозка,
	|	ТаблицаУслуг.Заявка КАК Заявка
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.РеализацияУслуг.Услуги КАК ТаблицаУслуг
	|ГДЕ
	|	ТаблицаУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Услуги.Перевозка КАК Перевозка,
	|	Услуги.Заявка КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ ПараметрыДок
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО Док.Ссылка = Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.Заявка,
	|	Услуги.Перевозка,
	|	Док.Организация,
	|	Док.Контрагент,
	|	Док.Период,
	|	Док.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтложенныеВзаиморасчетыОстатки.Организация КАК Организация,
	|	ОтложенныеВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ОтложенныеВзаиморасчетыОстатки.Перевозка КАК Перевозка,
	|	ОтложенныеВзаиморасчетыОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ОтложенныеВзаиморасчетыОстатки.Валюта КАК Валюта,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ОтложенныеВзаиморасчеты.Остатки(
	|			,
	|			(Организация, Контрагент, Перевозка, ДокументВзаиморасчетов, Валюта) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПараметрыДок.Организация КАК Организация,
	|					ПараметрыДок.Контрагент КАК Контрагент,
	|					ПараметрыДок.Перевозка КАК Перевозка,
	|					ПараметрыДок.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|					ПараметрыДок.Валюта КАК Валюта
	|				ИЗ
	|					ПараметрыДок КАК ПараметрыДок)) КАК ОтложенныеВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ЮТест.ОжидаетЧто(РезультатЗапроса.Пустой())
			.Равно(Истина, "Остатоки по запасам ушли в 0")
		;
	
КонецПроцедуры
	
Процедура ПроверкаЕстьОстаткиПоВзаиморасчетамСКонтрагентами() Экспорт
	
	Реализация = ЮТГенерацияДанных.СлучайнаяРеализацияУслуг();;
	
	ДокОбъект = Реализация.ПолучитьОбъект();;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.РеализацияУслуг КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаУслуг.Ссылка КАК Ссылка,
	|	ТаблицаУслуг.Услуга КАК Услуга,
	|	ТаблицаУслуг.Сумма КАК Сумма,
	|	ТаблицаУслуг.СуммаУпр КАК СуммаУпр,
	|	ТаблицаУслуг.Перевозка КАК Перевозка,
	|	ТаблицаУслуг.Заявка КАК Заявка
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.РеализацияУслуг.Услуги КАК ТаблицаУслуг
	|ГДЕ
	|	ТаблицаУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Период КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Услуги.Перевозка КАК Перевозка,
	|	Док.Ссылка КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ ПараметырДок
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО Док.Ссылка = Услуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.Организация КАК Организация,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Перевозка КАК Перевозка,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Валюта КАК Валюта,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			(Организация, Контрагент, Перевозка, ДокументВзаиморасчетов, Валюта) В
	|				(ВЫБРАТЬ
	|					ПараметырДок.Организация КАК Организация,
	|					ПараметырДок.Контрагент КАК Контрагент,
	|					ПараметырДок.Перевозка КАК Перевозка,
	|					ПараметырДок.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|					ПараметырДок.Валюта КАК Валюта
	|				ИЗ
	|					ПараметырДок КАК ПараметырДок)) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ЮТест.ОжидаетЧто(РезультатЗапроса.Пустой())
			.Равно(Ложь, "Есть остатки по взаиморасчетам с контрагентами")
		;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
