#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Перевозка.Пустая() Тогда
		ПеревозкаОбъект = Документы.Перевозка.СоздатьДокумент();
		ПеревозкаОбъект.Дата = ТекущаяДатаСеанса();
		ПеревозкаОбъект.Записать();     
		Перевозка = ПеревозкаОбъект.Ссылка;
	КонецЕсли;
	
	СуммаДокумента = Услуги.Итог("Сумма");
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;  
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		ПроверитьПеревозку();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	пзОбщегоНазначения.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.ЗапросНаПеревозку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	пзОбщегоНазначения.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	пзОбщегоНазначения.ОтразитьОтложенныеВзаиморасчеты(ДополнительныеСвойства, Движения, Отказ);
	
	пзОбщегоНазначения.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОтЗаказчика") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Валюта, Направление, Организация");
		
		ЭтотОбъект.Грузы.Загрузить(ДанныеЗаполнения.Грузы.Выгрузить());
		
		Для Каждого Строка Из Грузы Цикл
			Строка.Заявка = ДанныеЗаполнения;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПеревозку() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабГрузы.Груз КАК Груз,
	|	ТабГрузы.Заявка КАК Заявка
	|ПОМЕСТИТЬ Грузы
	|ИЗ
	|	&Грузы КАК ТабГрузы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаОтЗаказчика.Ссылка КАК Ссылка,
	|	ЗаявкаОтЗаказчика.Перевозка КАК Перевозка,
	|	ЗаявкаОтЗаказчика.Статус КАК Статус,
	|	ТабГрузы.Груз КАК Груз
	|ИЗ
	|	Документ.ЗаявкаОтЗаказчика КАК ЗаявкаОтЗаказчика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Грузы КАК ТабГрузы
	|		ПО ЗаявкаОтЗаказчика.Ссылка = ТабГрузы.Заявка
	|			И (ЗаявкаОтЗаказчика.Перевозка <> &Перевозка)
	|ИТОГИ
	|	МАКСИМУМ(Перевозка),
	|	МАКСИМУМ(Статус)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Грузы", Грузы.Выгрузить());
	Запрос.УстановитьПараметр("Перевозка", Перевозка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДокПеревозка = Перевозка.ПолучитьОбъект();
	ТаблицаПеревозок = ДокПеревозка.Перевозки;
	
	ВыборкаЗаявка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока ВыборкаЗаявка.Следующий() Цикл
		
		Выборка = ВыборкаЗаявка.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			Если ТаблицаПеревозок.НайтиСтроки(Новый Структура("Груз, Заявка, Запрос", Выборка.Груз, Выборка.Ссылка, Ссылка)).Количество() = 0 Тогда
				НоваяСтрока = ТаблицаПеревозок.Добавить();	
				НоваяСтрока.Заявка = Выборка.Ссылка;  
				НоваяСтрока.Груз = Выборка.Груз;
				НоваяСтрока.Запрос = Ссылка;
			КонецЕсли;	
			
		КонецЦикла;	  
		
		Если ВыборкаЗаявка.Статус = Перечисления.СтатусыЗаявок.Черновик Или Не ЗначениеЗаполнено(ВыборкаЗаявка.Перевозка) Тогда
			
			ЗаявкаОбъект = ВыборкаЗаявка.Ссылка.ПолучитьОбъект();
			ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявок.ВРаботе;    
			
			Если Не ЗначениеЗаполнено(ВыборкаЗаявка.Перевозка) Тогда
				ЗаявкаОбъект.Перевозка = Перевозка;;	
			КонецЕсли;
			
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ДокПеревозка.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры



#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
