#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты.ДобавитьТестовыйНабор("Документ Заявка от заказчика: Проверка записи и проведения").ВТранзакции()
		.ДобавитьТест("ПроверкаЗаписи")
		.ДобавитьТест("ПроверкаПроведения")
		.ДобавитьТест("ПроверкаПроведенияСКонтролемДвижений")
		;

КонецПроцедуры

Процедура ПроверкаЗаписи() Экспорт
	
	Заявка = ЮТГенерацияДанных.СлучайнаяЗаявка(
		ЮТГенерацияДанных.СлучайныйКонтрагент(Истина, Ложь, Ложь),
		ЮТГенерацияДанных.СлучайнаяОрганизация(Ложь),
		ЮТГенерацияДанных.СлучайноеНаправление(Ложь),
		ЮТГенерацияДанных.СлучайнаяУслуга(Ложь),
		ЮТГенерацияДанных.СлучайныйГруз(Ложь)
		); 
	
	ЮТест.ОжидаетЧто(Заявка.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Запись)   
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведения() Экспорт
	
	Заявка = ЮТГенерацияДанных.СлучайнаяЗаявка(
			ЮТГенерацияДанных.СлучайныйКонтрагент(Истина, Ложь, Ложь),
			ЮТГенерацияДанных.СлучайнаяОрганизация(Ложь),
			ЮТГенерацияДанных.СлучайноеНаправление(Ложь),
			ЮТГенерацияДанных.СлучайнаяУслуга(Ложь),
			ЮТГенерацияДанных.СлучайныйГруз(Ложь)
		); 
	
	ЮТест.ОжидаетЧто(Заявка.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведенияСКонтролемДвижений() Экспорт
	
	Заявка = ЮТГенерацияДанных.СлучайнаяЗаявка(
			ЮТГенерацияДанных.СлучайныйКонтрагент(Истина, Ложь, Ложь),
			ЮТГенерацияДанных.СлучайнаяОрганизация(Ложь),
			ЮТГенерацияДанных.СлучайноеНаправление(Ложь),
			ЮТГенерацияДанных.СлучайнаяУслуга(Ложь),
			ЮТГенерацияДанных.СлучайныйГруз(Ложь)
		); 
	
	ЮТест.ОжидаетЧто(Заявка.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   
		.НеВыбрасываетИсключение()	
		;
		
	ДокОбъект = Заявка.ПолучитьОбъект();	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Для каждого Движ Из ДокОбъект.Движения Цикл
		ЮТест.ОжидаетЧто(Движ.Количество())
			.Равно(0, "Проверка наличия движений. У черновика движений не должно быть")
		;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
