
&НаСервере
Процедура СгенерироватьИОтправитьФиктивныеЗаявкиНаСервере()
	
	МассивДанных = Новый Массив;
	
	НачатьТранзакцию();
	
	Для Нум = 1 По КоличествоОбъектов Цикл
		
		Заказ = ЮТГенерацияДанных.СлучайнаяЗаявка(
			ЮТГенерацияДанных.СлучайныйКонтрагент(Истина, Ложь, Ложь),
			ЮТГенерацияДанных.СлучайнаяОрганизация(Ложь),
			ЮТГенерацияДанных.СлучайноеНаправление(Ложь),
			ЮТГенерацияДанных.СлучайнаяУслуга(Ложь),
			ЮТГенерацияДанных.СлучайныйГруз(Ложь)
		);
		
		Док = Заказ.ПолучитьОбъект();
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекстСообщения = КафкаСервер.СериализоватьОбъект(Заказ);
		Заголовки = Новый Массив;  
		МассивДанных.Добавить(Новый Структура("Key, Value, Headers", Строка(Заказ.УникальныйИдентификатор()), ТекстСообщения, Заголовки))
	
	КонецЦикла;    
	
	ОтменитьТранзакцию();
	
	СообщенияОтправить = КафкаСервер.СтруктуруВJSON(МассивДанных);
	
	ТекстОшибки = "";
	КафкаСервер.ОтправитьСообщение(КафкаСервер.ПолучитьТопикОбъекта(Документы.ЗаявкаОтЗаказчика.ПустаяСсылка()), 
		СообщенияОтправить, ТекстОшибки);
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьИОтправитьФиктивныеЗаявки(Команда)
	СгенерироватьИОтправитьФиктивныеЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СгенерироватьГрузыНаСервере()
	
	Для Нум = 1 По КоличествоОбъектов Цикл
		Заказ = ЮТГенерацияДанных.СлучайныйГруз(Истина);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьГрузы(Команда)
	СгенерироватьГрузыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьОрганизации(Команда)
	СгенерироватьОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СгенерироватьОрганизацииНаСервере()
	Для Нум = 1 По КоличествоОбъектов Цикл
		Заказ = ЮТГенерацияДанных.СлучайнаяОрганизация(Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СгенерироватьКонтрагентыНаСервере()
	Для Нум = 1 По КоличествоОбъектов Цикл
		Заказ = ЮТГенерацияДанных.СлучайныйКонтрагент(Заказчик, Перевозчик, Истина);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьКонтрагенты(Команда)
	СгенерироватьКонтрагентыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СгенерироватьНаправленияНаСервере()
	Для Нум = 1 По КоличествоОбъектов Цикл
		Заказ = ЮТГенерацияДанных.СлучайноеНаправление(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьНаправления(Команда)
	СгенерироватьНаправленияНаСервере();
КонецПроцедуры
