#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	пзОбщегоНазначения.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.ПоступлениеУслуг.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	пзОбщегоНазначения.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	пзОбщегоНазначения.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	пзОбщегоНазначения.ОтразитьОтложенныеВзаиморасчеты(ДополнительныеСвойства, Движения, Отказ);
	
	пзОбщегоНазначения.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	КонтрольОстатков(Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗапросНаПеревозку") Тогда
		
		РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Перевозка, Услуги");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Валюта, Контрагент, Организация, СуммаДокумента");	
		
		Услуги.Загрузить(РеквизитыЗаявки.Услуги.Выгрузить());
		
		Для Каждого Строка Из Услуги Цикл
			Строка.Перевозка = РеквизитыЗаявки.Перевозка;
			Строка.Запрос = ДанныеЗаполнения;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольОстатков(Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОтложенныеВзаиморасчеты");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.УстановитьЗначение("Валюта", Валюта);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Услуги;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Перевозка", "Перевозка");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументВзаиморасчетов", "Запрос");
	Блокировка.Заблокировать(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Валюта КАК Валюта,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Организация КАК Организация,
	|	ДокУслуги.Запрос КАК ДокументВзаиморасчетов,
	|	ДокУслуги.Перевозка КАК Перевозка
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.ПоступлениеУслуг.Услуги КАК ДокУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслуг КАК Док
	|		ПО ДокУслуги.Ссылка = Док.Ссылка
	|			И (Док.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтложенныеВзаиморасчетыОстатки.Организация КАК Организация,
	|	ОтложенныеВзаиморасчетыОстатки.Контрагент КАК Контрагент,
	|	ОтложенныеВзаиморасчетыОстатки.Перевозка КАК Перевозка,
	|	ОтложенныеВзаиморасчетыОстатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ОтложенныеВзаиморасчетыОстатки.Валюта КАК Валюта,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ОтложенныеВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ОтложенныеВзаиморасчеты.Остатки(
	|			&МоментВремени,
	|			(Контрагент, Организация, Перевозка, ДокументВзаиморасчетов, Валюта) В
	|				(ВЫБРАТЬ
	|					Док.Контрагент КАК Контрагент,
	|					Док.Организация КАК Организация,
	|					Док.Перевозка КАК Перевозка,
	|					Док.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|					Док.Валюта КАК Валюта
	|				ИЗ
	|					Док КАК Док)) КАК ОтложенныеВзаиморасчетыОстатки
	|ГДЕ
	|	(ОтложенныеВзаиморасчетыОстатки.СуммаОстаток > 0
	|			ИЛИ ОтложенныеВзаиморасчетыОстатки.СуммаУпрОстаток > 0)";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма поступления больше суммы запроса",,,, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
