#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты.ДобавитьТестовыйНабор("Документ Запрос на перевозку: Проверка записи и проведения").ВТранзакции()
		.ДобавитьТест("ПроверкаЗаписи")
		.ДобавитьТест("ПроверкаПроведения")
		.ДобавитьТест("ПроверкаПроведенияСКонтролемДвижений")
		;

КонецПроцедуры

Процедура ПроверкаЗаписи() Экспорт
	
	Запрос = ЮТГенерацияДанных.СлучайныйЗапрос(); 
	
	ЮТест.ОжидаетЧто(Запрос.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Запись)   
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведения() Экспорт
	
	Запрос = ЮТГенерацияДанных.СлучайныйЗапрос(); 
	
	ЮТест.ОжидаетЧто(Запрос.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведенияСКонтролемДвижений() Экспорт
	
	Запрос = ЮТГенерацияДанных.СлучайныйЗапрос(); 
	
	ЮТест.ОжидаетЧто(Запрос.ПолучитьОбъект())  
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   
		.НеВыбрасываетИсключение()	
		;
		
	ДокОбъект = Запрос.ПолучитьОбъект();	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Для каждого Движ Из ДокОбъект.Движения Цикл
		ЮТест.ОжидаетЧто(Движ.Количество())
			.БольшеИлиРавно(1, "Проверка наличия движений.")
		;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
